3-1. 갈 때 4km/h로 가고 올 때 5km/h로 왔다면 왕복 평균 속도는 (조화평균)

x = 2ab / (a+b)

In [1]:
a = 4
b = 5

x = 2*a*b / (a+b)
print(x)

4.444444444444445

3-2. 연매출이 3000, 40000, 5000이었다면 연평균 몇배가 증가한 것인가? (기하평균)

In [1]:
import numpy as np
year1 = 4000/3000 - 1
year2 = 5000/4000 - 1

x = np.sqrt(year1 * year2)
print(x)

0.28867513459481287

3-3. 남성, 여성의 등산, 수영에 대한 취미 선호도 빈도표를 보고 남성 중에서 등산을 좋아할 확률을 구하시오.

In [4]:
import pandas as pd
df = pd.DataFrame({'등산' : [20,15], '수영':[15,30]},
      index=['남자', '여자'])
df

    등산  수영
남자  20  15
여자  15  30

In [14]:
man = df[df.index == '남자'].sum(axis=1)
mountain = df['등산'][0]
print('남성중에서 등산을 좋아할 확률 : ', mountain/man)

남성중에서 등산을 좋아할 확률 :  남자    0.571429
dtype: float64

6. 1개년 50억, 2개년 60억, 3개년 70억의 예산을 가지고 NPV(순현재가치)가 가장 높아지는 안을 제시하시오.

In [16]:
from itertools import combinations
import pandas as pd

investment_df = pd.DataFrame([[10,20,15],
                              [15,14,19],
                              [12,11,30],
                              [13,25,20],
                              [16,30,24]],
                             index=[1,2,3,4,5], columns=['yr1', 'yr2', 'yr3'])
investment_df

   yr1  yr2  yr3
1   10   20   15
2   15   14   19
3   12   11   30
4   13   25   20
5   16   30   24

In [20]:
items = [1,2,3,4,5]
combination_list = list(combinations(items, 2)) + list(combinations(items,3))
result_df = pd.DataFrame()

for c in combination_list:
    temp_df = pd.DataFrame()
    
    for item in items:
        if item in c:
            temp_df = pd.concat([temp_df, investment_df.loc[item]], axis=1)
            
    result_df = pd.concat([result_df, temp_df.sum(axis=1)], axis=1)
    
result_df.columns = combination_list

df_t = result_df.T
df_t = df_t[(df_t['yr1'] < 50) & (df_t['yr2'] < 60) & (df_t['yr3'] < 70)]
df_t['total'] = df_t.sum(axis=1)
df_t.sort_values(by='total', ascending=False)

           yr1  yr2  yr3  total
(2, 3, 4)   40   50   69    159
(1, 3, 4)   35   56   65    156
(1, 2, 4)   38   59   54    151
(1, 2, 3)   37   45   64    146
(4, 5)      29   55   44    128
(3, 5)      28   41   54    123
(2, 5)      31   44   43    118
(1, 5)      26   50   39    115
(3, 4)      25   36   50    111
(2, 4)      28   39   39    106
(1, 4)      23   45   35    103
(2, 3)      27   25   49    101
(1, 3)      22   31   45     98
(1, 2)      25   34   34     93